In [1]:
import pandas as pd

In [2]:
# Store filepath in a variable
uni_enrol_file = "../Project/Resources/Raw_Data/University_Enrollment.csv"

In [3]:
# Read the Data file with the pandas library
uni_enrol_df = pd.read_csv(uni_enrol_file)

uni_enrol_df.head()

,University,City,Gender,2020-2021 (Undergrad),2020-2021 (Graduate)
0,Algoma,SAULT STE. MARIE,Female,764,0
1,Algoma,SAULT STE. MARIE,Male,648,0
2,Algoma,SAULT STE. MARIE,N/A or Another,0,0
3,Brock,ST. CATHARINES,Female,8600,961
4,Brock,ST. CATHARINES,Male,6386,560

In [4]:
organized_df = uni_enrol_df[['City', '2020-2021 (Undergrad)', '2020-2021 (Graduate)']]

organized_df.head()

               City  2020-2021 (Undergrad)  2020-2021 (Graduate)
0  SAULT STE. MARIE                    764                     0
1  SAULT STE. MARIE                    648                     0
2  SAULT STE. MARIE                      0                     0
3    ST. CATHARINES                   8600                   961
4    ST. CATHARINES                   6386                   560

In [5]:
#Group by Cities and sum the categories
grouped_df = organized_df.groupby(['City']).sum()

grouped_df.head()

          2020-2021 (Undergrad)  2020-2021 (Graduate)
City
GUELPH                    23998                  2834
HAMILTON                  30560                  4215
HEARST                      162                     0
KINGSTON                  32614                  6455
LONDON                    32132                  6212

In [6]:
#Sum the Undergrad + Graduate

total_enrollment = grouped_df['2020-2021 (Undergrad)'] + grouped_df['2020-2021 (Graduate)']

grouped_df['Total Enrollment'] = total_enrollment

grouped_df.sort_values(['Total Enrollment'], ascending=False)

,2020-2021 (Undergrad),2020-2021 (Graduate),Total Enrollment
City,,,
TORONTO,100007,12315,112322
PETERBOROUGH,68002,19055,87057
WATERLOO,50107,5891,55998
KINGSTON,32614,6455,39069
LONDON,32132,6212,38344
OTTAWA,30402,4399,34801
HAMILTON,30560,4215,34775
GUELPH,23998,2834,26832
ST. CATHARINES,15263,1575,16838
WINDSOR,10772,4304,15076
OSHAWA,9152,546,9698
SUDBURY,6783,709,7492
THUNDER BAY,5756,1306,7062
NORTH BAY,3604,178,3782
SAULT STE. MARIE,1412,0,1412
HEARST,162,0,162

In [7]:
#Save the final copy to CSV

grouped_df.to_csv("../Project/Resources/Cleaned_Data/University_Enrollment.csv")